app/Controllers/Products.php

    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();
---
SELECT *
FROM `product`